#pragma once
//-----------------------------------------------------------------------------
#define TRACE() LCTracer Tracer(__FUNCTION__)
//-----------------------------------------------------------------------------
//Класс для трассировки функций.
//Воспользуйтесь макросом "TRACE" в начале трассируемой функции,
//чтобы получить информацию о временных затратах.
class LCTracer
{
public:
	LCTracer(const char *function_name);
	~LCTracer();

private:
	clock_t BeginTime;
	const char *FunctionName;
};
//-----------------------------------------------------------------------------
